//Double - একটি নাম্বার Datatype. এটির বিট সংখা হল ৬৪।

void main() {
  double Mark = 3.80;
  var y_mark = 3.96;

  print("My mark Is: $Mark");
  print("My mark Is: $y_mark");
}


//বর্ণনা: double ডেটা টাইপটি দশমিক সংখ্যা (floating-point) সংরক্ষণ করে। এটি সঠিক গাণিতিক হিসাবের জন্য ব্যবহৃত হয়, যেখানে ভগ্নাংশ প্রয়োজন হয়।
//double টাইপের ভেরিয়েবলগুলি সাধারণত পরিমাপ এবং গাণিতিক হিসাবের জন্য ব্যবহৃত হয়।
//Dart এ double এর মান ±1.7976931348623157 × 10^308 পর্যন্ত হতে পারে (64-বিট ভাসমান পয়েন্ট সংখ্যা)।

